using MudBlazor;
using Sunduk.PWA.Dialogs;

namespace Sunduk.PWA.Infrastructure.Templates
{
    public static class KnowlegdeInfo
    {
        public const string ISO_LANGUAGE = "G-код — наиболее распространенный и широко используемый язык программирования устройств с ЧПУ, также известный как ИСО 7-бит." +
            "Производители систем ЧПУ используют G-код в качестве базового языка программирования, дополнительно расширяя его по своему усмотрению.";
        public const string INTERPOLATION = "В данном контексте интерполяция обозначает движение инструмента по прямой линии или дуге.";
        public const string ABOLUTE_PROGRAMMING = "При программировании в абсолютных значениях указываются координаты относительно центра системы координат заготовки.";
        public const string INCREMENT_PROGRAMMING = "При программировании в относительных/инкрементных значениях указываются координаты относительно текущего положения инструмента.";
    }
}
